embassy-rs/stm32-data-sources/svd/stm32h7b0.svd
          <register>
            <name>FLASH_CCR1</name>
            <displayName>FLASH_CCR1</displayName>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CLR_EOP1</name>
                <description>Bank 1 EOP1 flag clear bit
Setting this bit to 1 resets to 0 EOP1 flag in FLASH_SR1 register.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_WRPERR1</name>
                <description>Bank 1 WRPERR1 flag clear bit
Setting this bit to 1 resets to 0 WRPERR1 flag in FLASH_SR1 register.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_PGSERR1</name>
                <description>Bank 1 PGSERR1 flag clear bit
Setting this bit to 1 resets to 0 PGSERR1 flag in FLASH_SR1 register.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_STRBERR1</name>
                <description>Bank 1 STRBERR1 flag clear bit
Setting this bit to 1 resets to 0 STRBERR1 flag in FLASH_SR1 register.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_INCERR1</name>
                <description>Bank 1 INCERR1 flag clear bit
Setting this bit to 1 resets to 0 INCERR1 flag in FLASH_SR1 register.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_RDPERR1</name>
                <description>Bank 1 RDPERR1 flag clear bit
Setting this bit to 1 resets to 0 RDPERR1 flag in FLASH_SR1 register.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_RDSERR1</name>
                <description>Bank 1 RDSERR1 flag clear bit
Setting this bit to 1 resets to 0 RDSERR1 flag in FLASH_SR1 register.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_SNECCERR1</name>
                <description>Bank 1 SNECCERR1 flag clear bit
Setting this bit to 1 resets to 0 SNECCERR1 flag in FLASH_SR1 register. If the DBECCERR1 flag of FLASH_SR1 register is cleared to 0, FLASH_ECC_FA1R register is reset to 0 as well.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_DBECCERR1</name>
                <description>Bank 1 DBECCERR1 flag clear bit
Setting this bit to 1 resets to 0 DBECCERR1 flag in FLASH_SR1 register. If the SNECCERR1 flag of FLASH_SR1 register is cleared to 0, FLASH_ECC_FA1R register is reset to 0 as well.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_CRCEND1</name>
                <description>Bank 1 CRCEND1 flag clear bit
Setting this bit to 1 resets to 0 CRCEND1 flag in FLASH_SR1 register.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLR_CRCRDERR1</name>
                <description>Bank 1 CRCRDERR1 flag clear bit
Setting this bit to 1 resets to 0 CRCRDERR1 flag in FLASH_SR1 register.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
		  <register>
			  <name>FLASH_OPTCR</name>
			  <displayName>FLASH_OPTCR</displayName>
			  <description>FLASH option control register</description>
			  <addressOffset>0x18</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000001</resetValue>
			  <fields>
				<field>
				  <name>OPTLOCK</name>
				  <description>FLASH_OPTCR lock option configuration
				  bit</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OPTSTART</name>
				  <description>Option byte start change option
				  configuration bit</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>MER</name>
				  <description>Flash mass erase enable
				  bit</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>PG_OTP</name>
				  <description>OTP program control bit</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OPTCHANGEERRIE</name>
				  <description>Option byte change error interrupt
				  enable bit</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>SWAP_BANK</name>
				  <description>Bank swapping configuration
				  bit</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
			  </fields>
          </register>	           		   
		  <register>
			  <name>FLASH_OPTSR_CUR</name>
			  <displayName>FLASH_OPTSR_CUR</displayName>
			  <description>FLASH option status register</description>
			  <addressOffset>0x1C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>OPT_BUSY</name>
				  <description>Option byte change ongoing
				  flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>BOR_LEV</name>
				  <description>Brownout level option status
				  bit</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>IWDG_SW</name>
				  <description>IWDG1 control option status
				  bit</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>NRST_STOP</name>
				  <description>D1 DStop entry reset option status
				  bit</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>NRST_STDY</name>
				  <description>D1 DStandby entry reset option status
				  bit</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>RDP</name>
				  <description>Readout protection level option status
				  byte</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>8</bitWidth>
				</field>
				<field>
				  <name>VDDMMC_HSLV</name>
				  <description>IWDG Stop mode freeze option status
				  bit</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>WDG_FZ_STOP</name>
				  <description>IWDG Stop mode freeze option status
				  bit</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>IWDG_FZ_SDBY</name>
				  <description>IWDG Standby mode freeze option status
				  bit</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ST_RAM_SIZE</name>
				  <description>DTCM RAM size option
				  status</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>SECURITY</name>
				  <description>Security enable option status
				  bit</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>								
				<field>
				  <name>VDDIO_HSLV</name>
				  <description>I/O high-speed at low-voltage status bit
				  (PRODUCT_BELOW_25V)</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OPTCHANGEERR</name>
				  <description>Option byte change error
				  flag</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>SWAP_BANK_OPT</name>
				  <description>Bank swapping option status
				  bit</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
			  </fields>
        </register>		   
          <register>
			  <name>FLASH_OPTSR_PRG</name>
			  <displayName>FLASH_OPTSR_PRG</displayName>
			  <description>FLASH option status register</description>
			  <addressOffset>0x20</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>BOR_LEV</name>
				  <description>BOR reset level option configuration
				  bits</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>IWDG_SW</name>
				  <description>IWDG1 option configuration
				  bit</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>NRST_STOP</name>
				  <description>Option byte erase after D1 DStop option
				  configuration bit</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>NRST_STDY</name>
				  <description>Option byte erase after D1 DStandby
				  option configuration bit</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>RDP</name>
				  <description>Readout protection level option
				  configuration byte</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>8</bitWidth>
				</field>
				<field>
				  <name>VDDMMC_HSLV</name>
				  <description>VDDMMC_HSLV</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>			
				<field>
				  <name>WDG_FZ_STOP</name>
				  <description>IWDG Stop mode freeze option
				  configuration bit</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>IWDG_FZ_SDBY</name>
				  <description>IWDG Standby mode freeze option
				  configuration bit</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ST_RAM_SIZE</name>
				  <description>DTCM size select option configuration
				  bits</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>SECURITY</name>
				  <description>Security option configuration
				  bit</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>								
				<field>
				  <name>VDDIO_HSLV</name>
				  <description>VDDIO_HSLV</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>SWAP_BANK_OPT</name>
				  <description>Bank swapping option configuration
				  bit</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
			  </fields>
        </register>         
          <register>
          <name>FLASH_OPTCCR</name>
          <displayName>FLASH_OPTCCR</displayName>
          <description>FLASH option clear control
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLR_OPTCHANGEERR</name>
              <description>OPTCHANGEERR reset bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>		  	   
          <register>
            <name>FLASH_PRAR_CUR1</name>
            <displayName>FLASH_PRAR_CUR1</displayName>
            <description>FLASH protection address for bank 1 </description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000F000</resetMask>
            <fields>
              <field>
                <name>PROT_AREA_START1</name>
                <description>Bank 1 PCROP area start status bits
These bits contain the first 256-byte block of the PCROP area in bank 1.
If this address is equal to PROT_AREA_END1, the whole bank 1 is PCROP protected.
If this address is higher than PROT_AREA_END1, no protection is set on bank 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PROT_AREA_END1</name>
                <description>Bank 1 PCROP area end status bits
These bits contain the last 256-byte block of the PCROP area in bank 1.
If this address is equal to PROT_AREA_START1, the whole bank 1 is PCROP protected.
If this address is lower than PROT_AREA_START1, no protection is set on bank 1.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DMEP1</name>
                <description>Bank 1 PCROP protected erase enable option status bit
If DMEP1 is set to 1, the PCROP protected area in bank 1 is erased when a protection level regression (change from level 1 to 0) or a bank erase with protection removal occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_PRAR_PRG1</name>
            <displayName>FLASH_PRAR_PRG1</displayName>
            <description>FLASH protection address for bank 1 </description>
            <addressOffset>0x2c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000F000</resetMask>
            <fields>
              <field>
                <name>PROT_AREA_START1</name>
                <description>Bank 1 PCROP area start configuration bits
These bits contain the first 256-byte block of the PCROP area in bank 1.
If this address is equal to PROT_AREA_END1, the whole bank 1 is PCROP protected.
If this address is higher than PROT_AREA_END1, no protection is set on bank 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PROT_AREA_END1</name>
                <description>Bank 1 PCROP area end configuration bits
These bits contain the last 256-byte block of the PCROP area in bank 1.
If this address is equal to PROT_AREA_START1, the whole bank 1 is PCROP protected.
If this address is lower than PROT_AREA_START1, no protection is set on bank 1.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMEP1</name>
                <description>Bank 1 PCROP protected erase enable option configuration bit
If DMEP1 is set to 1, the PCROP protected area in bank 1 is erased when a protection level regression (change from level 1 to 0) or a bank erase with protection removal occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SCAR_CUR1</name>
            <displayName>FLASH_SCAR_CUR1</displayName>
            <description>FLASH secure address for bank 1 </description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000F000</resetMask>
            <fields>
              <field>
                <name>SEC_AREA_START1</name>
                <description>Bank 1 secure-only area start status bits
These bits contain the first 256 bytes of block of the secure-only area in bank 1.
If this address is equal to SEC_AREA_END1, the whole bank 1 is secure access only.
If this address is higher than SEC_AREA_END1, no protection is set on bank 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SEC_AREA_END1</name>
                <description>Bank 1 secure-only area end status bits
These bits contain the last 256-byte block of the secure-only area in bank 1.
If this address is equal to SEC_AREA_START1, the whole bank 1 is secure access only.
If this address is lower than SEC_AREA_START1, no protection is set on bank 1.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DMES1</name>
                <description>Bank 1 secure access protected erase enable option status bit
If DMES1 is set to 1, the secure access only area in bank 1 is erased when a protection level regression (change from level 1 to 0) or a bank erase with protection removal occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SCAR_PRG1</name>
            <displayName>FLASH_SCAR_PRG1</displayName>
            <description>FLASH secure address for bank 1 </description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000F000</resetMask>
            <fields>
              <field>
                <name>SEC_AREA_START1</name>
                <description>Bank 1 secure-only area start configuration bits
These bits contain the first block of 256 bytes of the secure-only area in bank 1.
If this address is equal to SEC_AREA_END1, the whole bank 1 is secure access only.
If this address is higher than SEC_AREA_END1, no protection is set on bank 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SEC_AREA_END1</name>
                <description>Bank 1 secure-only area end configuration bits
These bits contain the last block of 256 bytes of the secure-only area in bank 1.
If this address is equal to SEC_AREA_START1, the whole bank 1 is secure access only.
If this address is lower than SEC_AREA_START1, no protection is set on bank 1.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMES1</name>
                <description>Bank 1 secure access protected erase enable option configuration bit
If DMES1 is set to 1, the secure access only area in bank 1 is erased when a protection level regression (change from level 1 to 0) or a bank erase with protection removal occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WPSGN_CUR1R</name>
            <displayName>FLASH_WPSGN_CUR1R</displayName>
            <description>FLASH write sector group protection for bank 1	</description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSGn1</name>
                <description>Bank 1 sector group protection option status byte
Each FLASH_WPSGN_CUR1R bit reflects the write protection status of the corresponding group of four consecutive sectors in bank 1 (0: the group is write protected; 1: the group is not write protected)
Bit 0: Group embedding sectors 0 to 3
Bit 1: Group embedding sectors 4 to 7
Bit N: Group embedding sectors 4 x N to 4 x N + 3
Bit 31: Group embedding sectors 124 to 127
Note: Bank 1 is limited to 16 and 64 sectors on STM32H7B0 and STM32H7A3xG devices, respectively.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WPSGN_PRG1R</name>
            <displayName>FLASH_WPSGN_PRG1R</displayName>
            <description>FLASH write sector group protection for bank 1	</description>
            <addressOffset>0x3c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSGn1</name>
                <description>Bank 1 sector group protection option status byte
Setting WRPSGn1 bits to 0 write protects the corresponding group of four consecutive sectors in bank 1 (0: the group is write protected; 1: the group is not write protected)
Bit 0: Group embedding sectors 0 to 3
Bit 1: Group embedding sectors 4 to 7
Bit N: Group embedding sectors 4 x N to 4 x N + 3
Bit 31: Group embedding sectors 124 to 127
Note: Bank 1 is limited to 16 and 64 sectors on STM32H7B0 and STM32H7A3xG devices, respectively.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>		  
		  <register>
          <name>FLASH_BOOT_CURR</name>
          <displayName>FLASH_BOOT_CURR</displayName>
          <description>FLASH register with boot
          address</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_ADD0</name>
              <description>Boot address 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BOOT_ADD1</name>
              <description>Boot address 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>		  
