embassy-rs/stm32-data-sources/svd/stm32h7b0.svd
        </registers>
    </peripheral>
    <peripheral>
         <name>DBGMCU</name>
         <description>Microcontroller Debug Unit</description>
         <groupName>DBGMCU</groupName>
         <baseAddress>0x5C001000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IDC</name>
               <displayName>IDC</displayName>
               <description>DBGMCU Identity Code Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x10006480</resetValue>
               <fields>
                  <field>
                     <name>DEV_ID</name>
                     <description>Device ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>REV_ID</name>
                     <description>Revision</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>DBGMCU Configuration Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBGSLEEP_CD</name>
                     <description> Allow D1 domain debug in Sleep mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGSTOP_CD</name>
                     <description>Allow D1 domain debug in Stop mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGSTBY_CD</name>
                     <description>Allow D1 domain debug in Standby mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>                 				                                    
				  <field>
                     <name>DBGSTOP_SRD</name>
                     <description>debug in SmartRun domain Stop mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGSTBY_SRD</name>
                     <description>debug in SmartRun domain Standby mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				
				  <field>
                     <name>TRACECLKEN</name>
                     <description>Trace port clock enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>CDDBGCKEN</name>
                     <description> CPU domain debug clock enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRDDBGCKEN</name>
                     <description>SmartRun domain debug clock enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>TRGOEN</name>
                     <description>External trigger output enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				  
               </fields>
            </register>
            <register>
               <name>APB3FZ1</name>
               <displayName>APB3FZ1</displayName>
               <description>DBGMCU APB3 peripheral freeze register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WWDG</name>
                     <description>WWDG stop in debug</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>                                                 
               </fields>
            </register>           
			<register>
               <name>APB1LFZ1</name>
               <displayName>APB1LFZ1</displayName>
               <description>DBGMCU APB1L peripheral freeze register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIM2</name>
                     <description>TIM2 stop in debug</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM3</name>
                     <description>TIM3 stop in debug</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM4</name>
                     <description>TIM4 stop in debug</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM5</name>
                     <description>TIM5 stop in debug</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM6</name>
                     <description>TIM6 stop in debug</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM7</name>
                     <description>TIM7 stop in debug</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM12</name>
                     <description>TIM12 stop in debug</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM13</name>
                     <description>TIM13 stop in debug</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				   <field>
                     <name>TIM14</name>
                     <description>TIM14 stop in debug</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				   <field>
                     <name>LPTIM1</name>
                     <description> LPTIM1 stop in debug</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				  
				  <field>
                     <name>I2C1</name>
                     <description> I2C1 SMBUS timeout stop in debug </description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>I2C2</name>
                     <description> I2C2 SMBUS timeout stop in debug</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>I2C3</name>
                     <description> I2C3 SMBUS timeout stop in debug</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				   
               </fields>
            </register>           	                     
            <register>
               <name>APB2FZ1</name>
               <displayName>APB2FZ1</displayName>
               <description>DBGMCU APB2 peripheral freeze register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIM1</name>
                     <description> TIM1 stop in debug</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM8</name>
                     <description> TIM8 stop in debug</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM15</name>
                     <description>TIM15 stop in debug</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>TIM16</name>
                     <description>TIM16 stop in debug</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>TIM17</name>
                     <description> TIM17 stop in debug</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				  				  
               </fields>
            </register>			
            <register>
               <name>APB4FZ1</name>
               <displayName>APB4FZ1</displayName>
               <description>DBGMCU APB4 peripheral freeze register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
			      <field>
                     <name>I2C4</name>
                     <description>I2C4 SMBUS timeout stop in debug</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
			      <field>
                     <name>LPTIM2</name>
                     <description> LPTIM2 stop in debug</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
			      <field>
                     <name>LPTIM3</name>
                     <description> LPTIM3 stop in debug</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>                                    
				  <field>
                     <name>RTC</name>
                     <description>RTC stop in debug</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDGLSCD</name>
                     <description>LS watchdog for CPU domain stop in debug</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				  				  
               </fields>
            </register>		
