embassy-rs/stm32-data-sources/svd/stm32h7b0.svd
        <register>
          <name>I2C_OAR2</name>
          <displayName>I2C_OAR2</displayName>
          <description>Access: No wait states, except if a write
          access occurs while a write access to this register is
          ongoing. In this case, wait states are inserted in the
          second write access until the previous one is completed.
          The latency of the second write access can be up to 2 x
          PCLK1 + 6 x I2CCLK.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OA2</name>
              <description>Interface address bits 7:1 of address
              Note: These bits can be written only when
              OA2EN=0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>OA2MSK</name>
              <description>Own Address 2 masks Note: These bits can
              be written only when OA2EN=0. As soon as OA2MSK is
              not equal to 0, the reserved I2C addresses (0b0000xxx
              and 0b1111xxx) are not acknowledged even if the
              comparison matches.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OA2EN</name>
              <description>Own Address 2 enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_TIMINGR</name>
          <displayName>I2C_TIMINGR</displayName>
          <description>Access: No wait states</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCLL</name>
              <description>SCL low period (master mode) This field
              is used to generate the SCL low period in master
              mode. tSCLL = (SCLL+1) x tPRESC Note: SCLL is also
              used to generate tBUF and tSU:STA
              timings.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SCLH</name>
              <description>SCL high period (master mode) This field
              is used to generate the SCL high period in master
              mode. tSCLH = (SCLH+1) x tPRESC Note: SCLH is also
              used to generate tSU:STO and tHD:STA
              timing.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SDADEL</name>
              <description>Data hold time This field is used to
              generate the delay tSDADEL between SCL falling edge
              and SDA edge. In master mode and in slave mode with
              NOSTRETCH = 0, the SCL line is stretched low during
              tSDADEL. tSDADEL= SDADEL x tPRESC Note: SDADEL is
              used to generate tHD:DAT timing.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SCLDEL</name>
              <description>Data setup time This field is used to
              generate a delay tSCLDEL between SDA edge and SCL
              rising edge. In master mode and in slave mode with
              NOSTRETCH = 0, the SCL line is stretched low during
              tSCLDEL. tSCLDEL = (SCLDEL+1) x tPRESC Note: tSCLDEL
              is used to generate tSU:DAT timing.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PRESC</name>
              <description>Timing prescaler This field is used to
              prescale I2CCLK in order to generate the clock period
              tPRESC used for data setup and hold counters (refer
              to I2C timings on page9) and for SCL high and low
              level counters (refer to I2C master initialization on
              page24). tPRESC = (PRESC+1) x tI2CCLK</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_TIMEOUTR</name>
          <displayName>I2C_TIMEOUTR</displayName>
          <description>Access: No wait states, except if a write
          access occurs while a write access to this register is
          ongoing. In this case, wait states are inserted in the
          second write access until the previous one is completed.
          The latency of the second write access can be up to 2 x
          PCLK1 + 6 x I2CCLK.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMEOUTA</name>
              <description>Bus Timeout A This field is used to
              configure: The SCL low timeout condition tTIMEOUT
              when TIDLE=0 tTIMEOUT= (TIMEOUTA+1) x 2048 x tI2CCLK
              The bus idle condition (both SCL and SDA high) when
              TIDLE=1 tIDLE= (TIMEOUTA+1) x 4 x tI2CCLK Note: These
              bits can be written only when
              TIMOUTEN=0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TIDLE</name>
              <description>Idle clock timeout detection Note: This
              bit can be written only when
              TIMOUTEN=0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMOUTEN</name>
              <description>Clock timeout enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMEOUTB</name>
              <description>Bus timeout B This field is used to
              configure the cumulative clock extension timeout: In
              master mode, the master cumulative clock low extend
              time (tLOW:MEXT) is detected In slave mode, the slave
              cumulative clock low extend time (tLOW:SEXT) is
              detected tLOW:EXT= (TIMEOUTB+1) x 2048 x tI2CCLK
              Note: These bits can be written only when
              TEXTEN=0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TEXTEN</name>
              <description>Extended clock timeout
              enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_ISR</name>
          <displayName>I2C_ISR</displayName>
          <description>Access: No wait states</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>TXE</name>
              <description>Transmit data register empty
              (transmitters) This bit is set by hardware when the
              I2C_TXDR register is empty. It is cleared when the
              next data to be sent is written in the I2C_TXDR
              register. This bit can be written to 1 by software in
              order to flush the transmit data register I2C_TXDR.
              Note: This bit is set by hardware when
              PE=0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXIS</name>
              <description>Transmit interrupt status (transmitters)
              This bit is set by hardware when the I2C_TXDR
              register is empty and the data to be transmitted must
              be written in the I2C_TXDR register. It is cleared
              when the next data to be sent is written in the
              I2C_TXDR register. This bit can be written to 1 by
              software when NOSTRETCH=1 only, in order to generate
              a TXIS event (interrupt if TXIE=1 or DMA request if
              TXDMAEN=1). Note: This bit is cleared by hardware
              when PE=0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>Receive data register not empty
              (receivers) This bit is set by hardware when the
              received data is copied into the I2C_RXDR register,
              and is ready to be read. It is cleared when I2C_RXDR
              is read. Note: This bit is cleared by hardware when
              PE=0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>Address matched (slave mode) This bit is
              set by hardware as soon as the received slave address
              matched with one of the enabled slave addresses. It
              is cleared by software by setting ADDRCF bit. Note:
              This bit is cleared by hardware when
              PE=0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NACKF</name>
              <description>Not Acknowledge received flag This flag
              is set by hardware when a NACK is received after a
              byte transmission. It is cleared by software by
              setting the NACKCF bit. Note: This bit is cleared by
              hardware when PE=0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STOPF</name>
              <description>Stop detection flag This flag is set by
              hardware when a Stop condition is detected on the bus
              and the peripheral is involved in this transfer:
              either as a master, provided that the STOP condition
              is generated by the peripheral. or as a slave,
              provided that the peripheral has been addressed
              previously during this transfer. It is cleared by
              software by setting the STOPCF bit. Note: This bit is
              cleared by hardware when PE=0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TC</name>
              <description>Transfer Complete (master mode) This
              flag is set by hardware when RELOAD=0, AUTOEND=0 and
              NBYTES data have been transferred. It is cleared by
              software when START bit or STOP bit is set. Note:
              This bit is cleared by hardware when
              PE=0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCR</name>
              <description>Transfer Complete Reload This flag is
              set by hardware when RELOAD=1 and NBYTES data have
              been transferred. It is cleared by software when
              NBYTES is written to a non-zero value. Note: This bit
              is cleared by hardware when PE=0. This flag is only
              for master mode, or for slave mode when the SBC bit
              is set.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BERR</name>
              <description>Bus error This flag is set by hardware
              when a misplaced Start or Stop condition is detected
              whereas the peripheral is involved in the transfer.
              The flag is not set during the address phase in slave
              mode. It is cleared by software by setting BERRCF
              bit. Note: This bit is cleared by hardware when
              PE=0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARLO</name>
              <description>Arbitration lost This flag is set by
              hardware in case of arbitration loss. It is cleared
              by software by setting the ARLOCF bit. Note: This bit
              is cleared by hardware when PE=0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overrun/Underrun (slave mode) This flag
              is set by hardware in slave mode with NOSTRETCH=1,
              when an overrun/underrun error occurs. It is cleared
              by software by setting the OVRCF bit. Note: This bit
              is cleared by hardware when PE=0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PECERR</name>
              <description>PEC Error in reception This flag is set
              by hardware when the received PEC does not match with
              the PEC register content. A NACK is automatically
              sent after the wrong PEC reception. It is cleared by
              software by setting the PECCF bit. Note: This bit is
              cleared by hardware when PE=0. If the SMBus feature
              is not supported, this bit is reserved and forced by
              hardware to 0. Please refer to Section25.3: I2C
              implementation.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout or tLOW detection flag This flag
              is set by hardware when a timeout or extended clock
              timeout occurred. It is cleared by software by
              setting the TIMEOUTCF bit. Note: This bit is cleared
              by hardware when PE=0. If the SMBus feature is not
              supported, this bit is reserved and forced by
              hardware to 0. Please refer to Section25.3: I2C
              implementation.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALERT</name>
              <description>SMBus alert This flag is set by hardware
              when SMBHEN=1 (SMBus host configuration), ALERTEN=1
              and a SMBALERT event (falling edge) is detected on
              SMBA pin. It is cleared by software by setting the
              ALERTCF bit. Note: This bit is cleared by hardware
              when PE=0. If the SMBus feature is not supported,
              this bit is reserved and forced by hardware to 0.
              Please refer to Section25.3: I2C
              implementation.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Bus busy This flag indicates that a
              communication is in progress on the bus. It is set by
              hardware when a START condition is detected. It is
              cleared by hardware when a Stop condition is
              detected, or when PE=0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Transfer direction (Slave mode) This
              flag is updated when an address match event occurs
              (ADDR=1).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDCODE</name>
              <description>Address match code (Slave mode) These
              bits are updated with the received address when an
              address match event occurs (ADDR = 1). In the case of
              a 10-bit address, ADDCODE provides the 10-bit header
              followed by the 2 MSBs of the address.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_ICR</name>
          <displayName>I2C_ICR</displayName>
          <description>Access: No wait states</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRCF</name>
              <description>Address matched flag clear Writing 1 to
              this bit clears the ADDR flag in the I2C_ISR
              register. Writing 1 to this bit also clears the START
              bit in the I2C_CR2 register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACKCF</name>
              <description>Not Acknowledge flag clear Writing 1 to
              this bit clears the ACKF flag in I2C_ISR
              register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPCF</name>
              <description>Stop detection flag clear Writing 1 to
              this bit clears the STOPF flag in the I2C_ISR
              register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERRCF</name>
              <description>Bus error flag clear Writing 1 to this
              bit clears the BERRF flag in the I2C_ISR
              register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARLOCF</name>
              <description>Arbitration Lost flag clear Writing 1 to
              this bit clears the ARLO flag in the I2C_ISR
              register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRCF</name>
              <description>Overrun/Underrun flag clear Writing 1 to
              this bit clears the OVR flag in the I2C_ISR
              register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PECCF</name>
              <description>PEC Error flag clear Writing 1 to this
              bit clears the PECERR flag in the I2C_ISR register.
              Note: If the SMBus feature is not supported, this bit
              is reserved and forced by hardware to 0. Please refer
              to Section25.3: I2C implementation.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMOUTCF</name>
              <description>Timeout detection flag clear Writing 1
              to this bit clears the TIMEOUT flag in the I2C_ISR
              register. Note: If the SMBus feature is not
              supported, this bit is reserved and forced by
              hardware to 0. Please refer to Section25.3: I2C
              implementation.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALERTCF</name>
              <description>Alert flag clear Writing 1 to this bit
              clears the ALERT flag in the I2C_ISR register. Note:
              If the SMBus feature is not supported, this bit is
              reserved and forced by hardware to 0. Please refer to
              Section25.3: I2C implementation.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_PECR</name>
          <displayName>I2C_PECR</displayName>
          <description>Access: No wait states</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PEC</name>
              <description>Packet error checking register This
              field contains the internal PEC when PECEN=1. The PEC
              is cleared by hardware when PE=0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_RXDR</name>
          <displayName>I2C_RXDR</displayName>
          <description>Access: No wait states</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>8-bit receive data Data byte received
              from the I2C bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_TXDR</name>
          <displayName>I2C_TXDR</displayName>
          <description>Access: No wait states</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>8-bit transmit data Data byte to be
              transmitted to the I2C bus. Note: These bits can be
              written only when TXE=1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
